Tekla Open API Reference for Tekla Structures 2025
ModifiedObjectInfo.IsCreated Field
Whether the object was created
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public readonly bool IsCreated
Public ReadOnly IsCreated As Boolean
Field Value
Type: Boolean
See Also
Reference
ModifiedObjectInfo Structure
Tekla.Structures.Model.History Namespace